; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v9)
             (pred_9 ?v10 ?v6)
             (pred_6 ?v5 ?v6)
             (pred_1 ?v12 ?v5 )
	     (pred_12 ?v5)
             (pred_3 ?v13)
             (pred_10 ?v10)
             (pred_8 ?v6)
             (pred_5 ?v5)
             (pred_2 ?v10)
             (pred_11 ?v5)
             (pred_4 ))



(:action op_4
:parameters (?v2 ?v3 ?v11 ?v4)
:precondition (and (pred_3 ?v2) (pred_3 ?v3) (pred_10 ?v11) (pred_8 ?v4)
          (pred_7 ?v2 ?v3) (pred_9 ?v11 ?v4)
                   (pred_6 ?v3 ?v4) (pred_12 ?v2) 
                   (pred_5 ?v3) (pred_2 ?v11))
:effect (and  (pred_11 ?v3) (not (pred_5 ?v3))))


(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_3 ?v2) (pred_3 ?v1)
               (pred_12 ?v2) (pred_7 ?v2 ?v1) (pred_11 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_3 ?v2) (pred_10 ?v11) 
                  (pred_12 ?v2) (pred_1 ?v11 ?v2) (pred_4 ))
:effect (and (pred_2 ?v11)
   (not (pred_1 ?v11 ?v2)) (not (pred_4 ))))


(:action op_1
:parameters (?v2 ?v8 ?v7)
:precondition (and (pred_3 ?v2) (pred_10 ?v8) (pred_10 ?v7)
                  (pred_12 ?v2) (pred_2 ?v7) (pred_1 ?v8 ?v2))
:effect (and (pred_2 ?v8) (pred_1 ?v7 ?v2)
        (not (pred_2 ?v7)) (not (pred_1 ?v8 ?v2))))

(:action op_3
:parameters (?v2 ?v11)
:precondition (and (pred_3 ?v2) (pred_10 ?v11) 
                  (pred_12 ?v2) (pred_2 ?v11))
:effect (and (pred_4 ) (pred_1 ?v11 ?v2) (not (pred_2 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_24 obj_21 obj_22 obj_18 obj_20 obj_16 obj_30 obj_06 obj_28 obj_17 obj_03 obj_29 obj_09 obj_12 obj_31 obj_14 obj_15 obj_05 obj_10 obj_07 obj_01 obj_26 obj_13 obj_23
    obj_08 obj_19 obj_27
    obj_25 obj_02 obj_11
    )

    (:init
       (pred_4)

       (pred_3 obj_04)
       (pred_3 obj_24)
       (pred_3 obj_21)
       (pred_3 obj_22)
       (pred_3 obj_18)
       (pred_3 obj_20)
       (pred_3 obj_16)
       (pred_3 obj_30)
       (pred_3 obj_06)
       (pred_3 obj_28)
       (pred_3 obj_17)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_09)
       (pred_3 obj_12)
       (pred_3 obj_31)
       (pred_3 obj_14)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_26)
       (pred_3 obj_13)
       (pred_3 obj_23)
       (pred_8 obj_08)
       (pred_8 obj_19)
       (pred_8 obj_27)
       (pred_10 obj_25)
       (pred_10 obj_02)
       (pred_10 obj_11)

       (pred_7 obj_04 obj_20)
       (pred_7 obj_04 obj_24)
       (pred_7 obj_24 obj_16)
       (pred_7 obj_24 obj_21)
       (pred_7 obj_24 obj_04)
       (pred_7 obj_21 obj_30)
       (pred_7 obj_21 obj_22)
       (pred_7 obj_21 obj_24)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_22 obj_18)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_18 obj_28)
       (pred_7 obj_18 obj_22)
       (pred_7 obj_20 obj_17)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_04)
       (pred_7 obj_16 obj_03)
       (pred_7 obj_16 obj_30)
       (pred_7 obj_16 obj_24)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_30 obj_29)
       (pred_7 obj_30 obj_06)
       (pred_7 obj_30 obj_21)
       (pred_7 obj_30 obj_16)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_28)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_06 obj_30)
       (pred_7 obj_28 obj_12)
       (pred_7 obj_28 obj_18)
       (pred_7 obj_28 obj_06)
       (pred_7 obj_17 obj_31)
       (pred_7 obj_17 obj_03)
       (pred_7 obj_17 obj_20)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_29)
       (pred_7 obj_03 obj_16)
       (pred_7 obj_03 obj_17)
       (pred_7 obj_29 obj_15)
       (pred_7 obj_29 obj_09)
       (pred_7 obj_29 obj_30)
       (pred_7 obj_29 obj_03)
       (pred_7 obj_09 obj_05)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_09 obj_29)
       (pred_7 obj_12 obj_10)
       (pred_7 obj_12 obj_28)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_31 obj_07)
       (pred_7 obj_31 obj_14)
       (pred_7 obj_31 obj_17)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_31)
       (pred_7 obj_15 obj_26)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_15 obj_29)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_05 obj_09)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_10 obj_23)
       (pred_7 obj_10 obj_12)
       (pred_7 obj_10 obj_05)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_31)
       (pred_7 obj_01 obj_26)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_26 obj_13)
       (pred_7 obj_26 obj_15)
       (pred_7 obj_26 obj_01)
       (pred_7 obj_13 obj_23)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_13 obj_26)
       (pred_7 obj_23 obj_10)
       (pred_7 obj_23 obj_13)
       (pred_5 obj_14)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_6  obj_14 obj_08)
       (pred_6  obj_06 obj_19)
       (pred_6  obj_01 obj_27)
       (pred_11 obj_04)
       (pred_11 obj_24)
       (pred_11 obj_21)
       (pred_11 obj_22)
       (pred_11 obj_18)
       (pred_11 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_30)
       (pred_11 obj_28)
       (pred_11 obj_17)
       (pred_11 obj_03)
       (pred_11 obj_29)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_11 obj_31)
       (pred_11 obj_15)
       (pred_11 obj_05)
       (pred_11 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_26)
       (pred_11 obj_13)
       (pred_11 obj_23)

       (pred_9  obj_25 obj_08)
       (pred_9  obj_02 obj_19)
       (pred_9  obj_11 obj_27)
       (pred_1 obj_25 obj_22)
       (pred_1 obj_02 obj_24)
       (pred_1 obj_11 obj_16)
       (pred_12 obj_07)
    )

    (:goal (and
       (pred_1 obj_25 obj_31)
       (pred_1 obj_02 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_30)))
)
)

; plan
1. (op_2 obj_07 obj_31)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_31)
   goals met: 0 of 2
2. (op_2 obj_31 obj_17)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_17)
   goals met: 0 of 2
3. (op_2 obj_17 obj_03)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_03)
   goals met: 0 of 2
4. (op_2 obj_03 obj_16)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_16)
   goals met: 0 of 2
5. (op_2 obj_16 obj_24)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_24)
   goals met: 0 of 2
6. (op_5 obj_24 obj_02)
   deleted: (pred_1 obj_02 obj_24) (pred_4)
   added: (pred_2 obj_02)
   goals met: 0 of 2
7. (op_2 obj_24 obj_21)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_21)
   goals met: 0 of 2
8. (op_2 obj_21 obj_22)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_22)
   goals met: 0 of 2
9. (op_4 obj_22 obj_06 obj_02 obj_19)
   deleted: (pred_5 obj_06)
   added: (pred_11 obj_06)
   goals met: 0 of 2
10. (op_2 obj_22 obj_06)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_06)
   goals met: 0 of 2
11. (op_2 obj_06 obj_09)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_09)
   goals met: 0 of 2
12. (op_3 obj_09 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_4) (pred_1 obj_02 obj_09)
   goals met: 1 of 2
13. (op_2 obj_09 obj_06)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_06)
   goals met: 1 of 2
14. (op_2 obj_06 obj_22)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_22)
   goals met: 1 of 2
15. (op_5 obj_22 obj_25)
   deleted: (pred_1 obj_25 obj_22) (pred_4)
   added: (pred_2 obj_25)
   goals met: 1 of 2
16. (op_2 obj_22 obj_21)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_21)
   goals met: 1 of 2
17. (op_2 obj_21 obj_24)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_24)
   goals met: 1 of 2
18. (op_2 obj_24 obj_04)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_04)
   goals met: 1 of 2
19. (op_2 obj_04 obj_20)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_20)
   goals met: 1 of 2
20. (op_2 obj_20 obj_17)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_17)
   goals met: 1 of 2
21. (op_2 obj_17 obj_31)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_31)
   goals met: 1 of 2
22. (op_3 obj_31 obj_25)
   deleted: (pred_2 obj_25)
   added: (pred_4) (pred_1 obj_25 obj_31)
   goals met: 2 of 2
